Rafa350/EOS/v2/Include/HTL/STM32/htlGPIO.h
#pragma once
/// \file      halGPIO_ex.h
/// \author    Rafael Serrano (rsr.openware@gmail.com)
/// \brief     GPIO module manager.
/// \addtogroup HTL HAL Template Library
/// @{
/// \addtogroup HTL_STM32 STM32
/// @{
/// \defgroup HTL_STM32_GPIO GPIO
/// @{
#ifndef __STM32_htlGPIO__
#define __STM32_htlGPIO__


// EOS includes
//
#include "eos.h"


namespace htl {

    /// \brief GPIO port identifiers.
    enum class GPIOPort {
        #ifdef GPIOA_BASE
            portA,
        #endif
        #ifdef GPIOB_BASE
            portB,
        #endif
        #ifdef GPIOC_BASE
            portC,
        #endif
        #ifdef GPIOD_BASE
            portD,
        #endif
        #ifdef GPIOE_BASE
            portE,
        #endif
        #ifdef GPIOF_BASE
            portF,
        #endif
        #ifdef GPIOG_BASE
            portG,
        #endif
        #ifdef GPIOH_BASE
            portH,
        #endif
        #ifdef GPIOI_BASE
            portI,
        #endif
        #ifdef GPIOJ_BASE
            portJ,
        #endif
        #ifdef GPIOK_BASE
            portK,
        #endif
    };

    /// \brief GPIO Pin identifiers.
    enum class GPIOPin {
        pin0,
        pin1,
        pin2,
        pin3,
        pin4,
        pin5,
        pin6,
        pin7,
        pin8,
        pin9,
        pin10,
        pin11,
        pin12,
        pin13,
        pin14,
        pin15
    };

    /// \brief GPIO Pull up/down mode identifier.
    enum class GPIOPull {
    	noChange,
        none,
        up,
        down
    };

    /// \brief GPIO Driver type identifiers.
    enum class GPIODriver {
        pushPull,
    	noChange,
        openDrain
    };

    /// \brief GPIO Speed identifier.
    enum class GPIOSpeed {
    	noChange,
        low,
        medium,
        high,
        fast
    };

    void GPIO_initInput(GPIO_TypeDef*, uint32_t, GPIOPull);
    void GPIO_initOutput(GPIO_TypeDef*, uint32_t, GPIODriver, GPIOSpeed);
    void GPIO_initAlt(GPIO_TypeDef*, uint32_t, GPIODriver, GPIOSpeed, unsigned);

    template <GPIOPort>
    struct GPIOPortTrait {
    };

    template <GPIOPort port_, GPIOPin pin_>
    struct GPIOPinTrait {
    };

    class GPIOAdapter final {
    	private:
          GPIO_TypeDef *_regs;
          uint32_t _pn;

     public:
         GPIOAdapter(
        	uint32_t addr,
			uint32_t pn) :

        	 _regs(reinterpret_cast<GPIO_TypeDef*>(addr)),
        	 _pn(pn) {
         }

         GPIOAdapter(const GPIOAdapter &) = default;
         GPIOAdapter(GPIOAdapter &&) = default;

         inline void set() const {

             _regs->BSRR = 1 << _pn;
         }

         inline void clear() const {

             _regs->BSRR = 1 << (_pn + 16);
         }

         inline void toggle() const {

             _regs->ODR ^= 1 << _pn;
         }

         inline bool read() const {

             return _regs->IDR & (1 << _pn);
         }
    };

    template <GPIOPort port_>
    class GPIOPortActivator final {
    	private:
    		static uint16_t _activated;

    	public:
    		static void activate(
    			uint16_t mask) {

    			if (!_activated) {
    				if constexpr (port_ == GPIOPort::portA)
    					RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;
    				else if constexpr (port_ == GPIOPort::portB)
    					RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN;
    				else if constexpr (port_ == GPIOPort::portC)
    					RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN;
    				else if constexpr (port_ == GPIOPort::portD)
    					RCC->AHB1ENR |= RCC_AHB1ENR_GPIODEN;
    				else if constexpr (port_ == GPIOPort::portE)
    					RCC->AHB1ENR |= RCC_AHB1ENR_GPIOEEN;
    				else if constexpr (port_ == GPIOPort::portF)
    					RCC->AHB1ENR |= RCC_AHB1ENR_GPIOFEN;
    				else if constexpr (port_ == GPIOPort::portG)
    					RCC->AHB1ENR |= RCC_AHB1ENR_GPIOGEN;
    				else if constexpr (port_ == GPIOPort::portH)
    					RCC->AHB1ENR |= RCC_AHB1ENR_GPIOHEN;
    				else if constexpr (port_ == GPIOPort::portI)
    					RCC->AHB1ENR |= RCC_AHB1ENR_GPIOIEN;
    				else if constexpr (port_ == GPIOPort::portJ)
    					RCC->AHB1ENR |= RCC_AHB1ENR_GPIOJEN;
    				else if constexpr (port_ == GPIOPort::portK)
    					RCC->AHB1ENR |= RCC_AHB1ENR_GPIOKEN;
    				__DSB();
    			}
    			_activated |= mask;
    		}

    		static void deactivate(
    			uint16_t mask) {

    			_activated &= ~mask;
    			if (!_activated) {
    				if constexpr (port_ == GPIOPort::portA)
    					RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOAEN;
    				else if constexpr (port_ == GPIOPort::portB)
    					RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOBEN;
    				else if constexpr (port_ == GPIOPort::portC)
    					RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOCEN;
    				else if constexpr (port_ == GPIOPort::portD)
    					RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIODEN;
    				else if constexpr (port_ == GPIOPort::portE)
    					RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOEEN;
    				else if constexpr (port_ == GPIOPort::portF)
    					RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOFEN;
    				else if constexpr (port_ == GPIOPort::portG)
    					RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOGEN;
    				else if constexpr (port_ == GPIOPort::portH)
    					RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOHEN;
    				else if constexpr (port_ == GPIOPort::portI)
    					RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOIEN;
    				else if constexpr (port_ == GPIOPort::portJ)
    					RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOJEN;
    				else if constexpr (port_ == GPIOPort::portK)
    					RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOKEN;
    			}
    		}
    };

    template <GPIOPort port_> uint16_t GPIOPortActivator<port_>::_activated = 0;


    /// \class GPIO_x
    /// \brief Adapter class for gpio pins
    ///
    template <GPIOPort port_, GPIOPin pin_>
    class GPIO_x final {
        public:
            using GPIOAlt = typename GPIOPinTrait<port_, pin_>::GPIOAlt;

        private:
            using PortTrait = GPIOPortTrait<port_>;
            using PinTrait = GPIOPinTrait<port_, pin_>;
            using Activator = GPIOPortActivator<port_>;
            static constexpr uint32_t _addr = PortTrait::addr;
            static constexpr uint32_t _pn = PinTrait::pn;

